<template>
  <div class="home">
    <h1>Тестовое задание Front-end</h1>
    <h2>Неоходимо создать СПА на Vue.js</h2>
    <p>Необходимо создать СПА на Vue.js.
      СПА должно поддерживать маршрутизацию посредством vue-router и иметь хранилище состояния,
      реализованное через Vuex.
      Шапка приложения должна содержать следующие ссылки маршрутов:
    </p>
    <ol>
      <li>“Главная” – статическая страница, на которой выводится текст данного ТЗ без картинок.</li>
      <li>
        “Вакууматоры” и “Дозаторы” страницы, на которых выводится таблица с товарами.
        Таблица содержит следующие столбцы: изображение, наименование, наличие и цена.
        Данные для таблицы получаются через API методом POST по адресу https://dev.alcotec.com.ua/api/products/ID,
        тело запроса должно содержать следующие параметры:
        <pre>
          sorting: { sortBy: "rating", isDesc: true},
          page: 1,
          perpage: 15,
          filter: {},
        </pre>
        Для вакууматоров ID = 322, дозаторов - 103.
        Url для доступа к изображениям https://dev.alcotec.com.ua
        В api реализовано несколько видов сортировок, НО вам необходимо реализовать сортировку самостоятельно,
        на фронте, без запроса к api и использования библиотек сторонних разработчиков.
        Сортировка должна быть реализована по параметру “Цена”.
        При загрузке сортировка должна быть как в запросе – по рейтингу.
        По клику на “Цена” – товары должны сортироваться по ниспадающей цене, при повторном клике – по возрастающей.
      </li>
      <li>
        “Условия возврата” и “Условия оплаты” – страницы, на которых выводится готовый статический контент
        с сервера посредством запроса к API методом GET по адресу https://dev.alcotec.com.ua/api/pages/alias.
        Для условий возврата alias: purchase-returns, для оплаты – payment.
        На страницах необходимо вывести наименование страницы в теге H1 и контент в отдельном блоке.
      </li>
      <li>
        Страница 404. Для всех несуществующих роутов или при ответе сервера при запросе
        несуществующей страницы – переадресовывать на страницу 404.
      </li>
    </ol>
    <p>
      В ответах от сервера, многие текстовые поля приходят на двух языках,
      для выполнения этого задания нужно брать статически только данные с индексом ‘ru’, где это необходимо.
      В хранилище не должно хранится ничего лишнего, кроме критически важного состояния,
      нужных мутаций и необходимых экшенов (предполагается что хранилище будет использовано для отправки,
      обработки и хранения данных с запросов). Результат выполнения должен быть залит на git.
      Репозиторий не должен содержать один единственный комит.
      У вас должен быть как минимум инициирующий комит – после создания и полной настройки проекта,
      и по комиту после завершения каждого пункта задания. Последовательность выполнения пунктов на ваше усмотрение.
    </p>
  </div>
</template>

<script>

export default {
  name: 'Home',
}
</script>
<style lang="scss" scoped>
p, ol{
  text-align: start;
}
</style>
